app/controllers/products_controller.rb

  def index
    # productsテーブルから最新順に作品を２０件取得する
    @products = Product.order('id ASC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY id DESC LIMIT 20