app/controllers/users_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` IN (1, 2)
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2
---
  def show
    @reviews = current_user.reviews.includes(:product)